;***********************************************************************************************
;                   ПРИМЕР ИСПОЛЬЗОВАНИЯ ФЛАГА "C" (А ТАКЖЕ И ФЛАГА "Z")
;***********************************************************************************************
; c_dc.asm      Стандартная подпрограмма суммирования двух трехбайтных чисел
;*********************************************************************************************** 

              RegH, RegM, RegL - трехбайтное число 1-го слагаемого.
        TimerH, TimerM, TimerL - трехбайтное число 2-го слагаемого.
        Результат суммирования сохраняется в регистрах TimerH, TimerM, TimerL.

;***********************************************************************************************
;                                 "ШАПКА ПРОГРАММЫ"
;===============================================================================================
;.............................................................
;.............................................................
;===============================================================================================
; Определение положения регистров специального назначения. 
;===============================================================================================
Status      equ        03h         ; Регистр Status.
;.............................................................
;.............................................................
;===============================================================================================
; Определение названия и положения регистров общего назачения.
;===============================================================================================
RegL        equ        0Ch         ; Регистр младшего разряда 1-го слагаемого.
RegM        equ        0Dh         ; Регистр среднего разряда 1-го слагаемого.
RegH        equ        0Eh         ; Регистр старшего разряда 1-го слагаемого.

TimerL      equ        1Ch         ; Регистр младшего разряда 2-го слагаемого.
TimerM      equ        1Dh         ; Регистр среднего разряда 2-го слагаемого.
TimerH      equ        1Eh         ; Регистр старшего разряда 2-го слагаемого.
;.............................................................
;.............................................................
;===============================================================================================
; Определение места размещения результатов операций.
;===============================================================================================
W           equ        0           ; Результат направить в аккумулятор.
F           equ        1           ; Результат направить в регистр.
;.............................................................
;===============================================================================================
; Присваивание битам названий.
;===============================================================================================
C           equ        0           ; Бит флага переноса-заема.
Z           equ        2           ; Бит флага нулевого результата.
;.............................................................
;===============================================================================================
            org        0           ; Начать выполнение программы 
            goto       START       ; с подпрограммы START.
;***********************************************************************************************

 

;***********************************************************************************************
;                               РАБОЧАЯ ЧАСТЬ ПРОГРАММЫ
;***********************************************************************************************
START       ......................................
            ......................................
YES         ......................................
            ......................................
            goto    PLUS
            ......................................
            ......................................
;===============================================================================================
; Суммирование двух трехбайтных двоичных чисел. Результат суммирования - трехбайтное двоичное
; число.
;===============================================================================================
PLUS        movf    RegL,W          ; Скопировать содержимое регистра RegL в регистр W.
            addwf   TimerL,F        ; Сложить содержимое регистров W и TimerL с сохранением
                                    ; результата в регистре TimerL.

            btfss   Status,C        ; Опрос бита № 0 (флага С) регистра Status.
            goto    PLUS_1          ; Если бит № 0 =0, то переход в ПП PLUS_1.
            incf    TimerM,F        ; Если бит № 0 =1, то инкремент содержимого регистра
                                    ; TimerM с сохранением результата в нем же.
            btfss   Status,Z        ; Опрос бита № 2 (флага Z) регистра Status.
            goto    PLUS_1          ; Если бит № 2 =0, то переход в ПП PLUS_1.
            incf    TimerH,F        ; Если бит № 2 =1, то инкремент содержимого регистра
                                    ; TimerH с сохранением результата в нем же.

PLUS_1      movf    RegM,W          ; Скопировать содержимое регистра RegM в регистр W.         
            addwf   TimerM,F        ; Сложить содержимое регистров W и TimerM с сохранением
                                    ; результата в регистре TimerM.
            btfsc   Status,C        ; Опрос бита № 0 (флага С) регистра Status.
            incf    TimerH,F        ; Если бит № 0 =1, то инкремент содержимого регистра
                                    ; TimerH с сохранением результата в нем же.
            movf    RegH,W          ; Если бит № 0 =0, то скопировать содержимое регистра RegH в регистр W.
            addwf   TimerH,F        ; Сложить содержимое регистров W и TimerH с сохранением
                                    ; результата в регистре TimerH.
            goto    YES             ; Безусловный переход в ПП YES.
;---------------------------------------------------------------------------------------------
            ......................................
            ......................................
;*********************************************************************************************
            end                     ; Конец программы.


==============================================================================================
                         АРИФМЕТИЧЕСКИЕ ПРИМЕРЫ  СУММИРОВАНИЙ
==============================================================================================
                      Случай отсутствия переносов
----------------------------------------------------------------------------------------------
                            80   120   100
                            60    50   100
                           ----------------
                           140   170   200    Значения чисел сумм не превышают 255.
----------------------------------------------------------------------------------------------
                      Случай наличия переносов № 1
---------------------------------------------------------------------------------------------- 
                                               Младший разряд
                    150          120           100
                    100          180           200            При суммировании  младших и 
                    --------------------------------          средних разрядов значения сумм
                    250+1=251    300+1-256=45  300-256=44     превысили 255 (2 переноса).
                    -------------------------------- 
                    251           45            44
----------------------------------------------------------------------------------------------
    Случай наличия переносов № 2. Дополнительно задействуется флаг Z (опрос его состояния).
----------------------------------------------------------------------------------------------
                                                Младший разряд
                    150           130           100
                    100           125           200            При суммировании младших и
                    ---------------------------------          средних разрядов значения сумм
                    250+1=251     255+1-256=0   300-256=44     превысили 255 (2 переноса).
                    ---------------------------------
                    251             0            44
----------------------------------------------------------------------------------------------



