;***********************************************************************************************
; flag_1.asm         ПРИМЕР ИСПОЛЬЗОВАНИЯ ФЛАГА НУЛЕВОГО РЕЗУЛЬТАТА "Z"
;***********************************************************************************************
    Вопрос: что должно произойти?
    Ответ: если, на момент анализа содержимого регистра буферной памяти, в нем записано любое
           из чисел от .00 до .04 включительно, то рабочая точка программы должна "уйти"
           в один сценарий работы "программы" (в подпрограмму YES), а если указанное  выше число
           не входит в  "зону" чисел от .00 до .04 включительно, то рабочая точка программы
           должна "уйти" в другой сценарий работы "программы" (в подпрограмму NO). 

;***********************************************************************************************
;                                 "ШАПКА ПРОГРАММЫ"
;===============================================================================================
;.............................................................
;.............................................................
;===============================================================================================
; Определение положения регистров специального назначения. 
;===============================================================================================
Status      equ        03h         ; Регистр Status.
;.............................................................
;.............................................................
;===============================================================================================
; Определение названия и положения регистров общего назачения.
;===============================================================================================
Registr     equ        0Ch         ; Регистр буферной памяти.
;.............................................................
;.............................................................
;===============================================================================================
; Определение места размещения результатов операций.
;===============================================================================================
W           equ        0           ; Результат направить в аккумулятор.
;.............................................................
;===============================================================================================
; Присваивание битам названий.
;===============================================================================================
RP0         equ        5           ; Бит выбора банка.
Z           equ        2           ; Бит флага нулевого результата.
;.............................................................
;===============================================================================================
            org        0           ; Начать выполнение программы 
            goto       START       ; с подпрограммы START.
;***********************************************************************************************

 

;***********************************************************************************************
;                               РАБОЧАЯ ЧАСТЬ ПРОГРАММЫ
;***********************************************************************************************
START       ......................................
            ......................................
            ......................................
;-----------------------------------------------------------------------------------------------
; ПП NO, в которую "уходит" рабочая точка программы, если анализируемое число не попадает в
; "зону" чисел от .00 до .04 включительно.
;-----------------------------------------------------------------------------------------------
NO          ......................................
            ......................................
;-----------------------------------------------------------------------------------------------
            ......................................
            ......................................
;===============================================================================================
; Реализация цифрового компаратора.
; Решение задачи о вхождении или нет анализируемого числа в "зону" чисел от .00 до .04 включительно.
;================================================================================================
            movf       Registr,W   ; Скопировать содержимое регистра Registr в регистр W. 
            bcf        Status,Z    ; Сбросить флаг нулевого результата Z.

            sublw      .00         ; Вычесть из константы .00 содержимое регистра W.
            btfsc      Status,Z    ; Результат  вычитания нулевой?
            goto       YES         ; Да. --->"уход" в ПП YES.
            movf       Registr,W   ; Нет. --->скопировать содержимое регистра Registr в регистр W. 

            sublw      .01         ; Вычесть из константы .01 содержимое регистра W.
            btfsc      Status,Z    ; Результат  вычитания нулевой?
            goto       YES         ; Да. --->"уход" в ПП YES.
            movf       Registr,W   ; Нет. --->скопировать содержимое регистра Registr в регистр W. 
                            
            sublw      .02         ; Вычесть из константы .02 содержимое регистра W.
            btfsc      Status,Z    ; Результат  вычитания нулевой?
            goto       YES         ; Да. --->"уход" в ПП YES.   
            movf       Registr,W   ; Нет. --->скопировать содержимое регистра Registr в регистр W. 

            sublw      .03         ; Вычесть из константы .03 содержимое регистра W.
            btfsc      Status,Z    ; Результат  вычитания нулевой?
            goto       YES         ; Да. --->"уход" в ПП YES.    
            movf       Registr,W   ; Нет. --->скопировать содержимое регистра Registr в регистр W. 

            sublw      .04         ; Вычесть из константы .04 содержимое регистра W.
            btfsc      Status,Z    ; Результат  вычитания нулевой?
            goto       YES         ; Да. --->"уход" в ПП YES.
            
            goto       NO          ; Нет. --->"уход" в ПП NO.
;---------------------------------------------------------------------------------------------
; ПП YES, в которую "уходит" рабочая точка программы, если анализируемое число попадает в
; "зону" чисел от .00 до .04 включительно.
;---------------------------------------------------------------------------------------------
YES         ......................................
            ......................................
;---------------------------------------------------------------------------------------------
            ......................................
            ......................................
;*********************************************************************************************
            end                     ; Конец программы.
